app/controllers/products_controller.rb

	def index
    @products = Product.all.order(params[:sort])
---
SELECT "products".* FROM "products"

	def create
		@product = current_user.products.build(products_params)

		respond_to do |format|
			if @product.save

				if params[:images]
					params[:images].each { |image|
						@product.pictures.create(image: image, imageable_id: @product.id)
---
INSERT INTO "products" ("author", "year", "title", "publisher", "edition", "isbn", "pages", "synopsis", "dimensions", "barcode", "active", "activation_reason", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

	def destroy
    product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]